const chapter2_theory = [
    `<p>Ένας πολύ ενδιαφέρων τρόπος να γνωρίσει κανεις την χώρα, είναι μέσα από τα δρώμενα και την κουζίνα της. 
    Η Ισπανία έχει πλούσια πολιτιστική κληρονομιά, παραδόσεις και γαστρονομία.
    Σε αυτή την ενότητα θα εξερευνήσουμε τα πιο γνωστά από αυτά, ώστε να ξέρεις τι να δεις και τι να φας!</p>`,

    `<p>Το <b>φλαμένκο</b> είναι ίσως ένα από τους πιο γνωστούς χορούς στον κόσμου,
    λόγω της αισθησιακής του φύσης. Είναι μια παραδοσιακή μορφή μουσικής και χορού που έχει τις ρίζες της στην <b>Ανδαλουσία</b>,
    στη Νότια Ισπανία. Αποτελείται από τρία βασικά στοιχεία: το τραγούδι <b>(cante)</b>,
    το χορό <b>(baile)</b> και τη μουσική της κιθάρας <b>(toque)</b>. Το φλαμένκo συνδέεται στενά με την πολιτιστική
    κληρονομιά των <b>Ρομά</b> και έχει αναγνωριστεί από την UNESCO ως <u>Άυλη Πολιτιστική Κληρονομιά</u> της Ανθρωπότητας.
    Είναι γνωστό για την εκφραστικότητα και το πάθος του,
    με τα μοναδικά ρυθμικά πατήματα και τις εντυπωσιακές κινήσεις χεριών και σώματος.</p>`,

    `<p>Το φεστιβαλ <b>San Fermín</b>, γνωστό και ως «Τρέξιμο των Ταύρων» <b>(Encierro)</b>,
    λαμβάνει χώρα κάθε <b>Ιούλιο</b> στην <b>Παμπλόνα</b> της Ισπανίας.
    Οι συμμετέχοντες τρέχουν στους δρόμους της πόλης μπροστά από μια ομάδα ταύρων,
    σε μία παράδοση που χρονολογείται από τον 14ο αιώνα.
    Το φεστιβαλ διαρκεί μια εβδομάδα και περιλαμβάνει επίσης παραδοσιακές θρησκευτικές τελετές,
    μουσικές και χορευτικές εκφηλώσεις, καθώς και πυροτεχνήματα.</p>`,

    `<p>Η <b>La Tomatina</b> είναι ένα φεστιβάλ που λαμβάνει χώρα την τελευταία Τετάρτη του <b>Αυγούστου</b> στην πόλη <b>Μπουνιόλ</b>,
    κοντά στην Βαλένθια. Κατά τη διάρκεια του φεστιβάλ, χιλιάδες άνθρωποι συμμετέχουν
    σε μια μαζική μάχη που ρίχνουν ντομάτες ο ένας στον άλλο.
    Η εκδήλωση ξεκίνησε τη δεκαετία του <b>1940</b> και έχει εξελιχθεί σε ένα δημοφιλές τουριστικό αξιοθέατο.</p>`,
    
    `<p>Οι Ταυρομαχίες <b>(Corrida de Toros)</b> είναι μια παραδοσιακή ισπανική παράδοση που περιλαμβάνει μάχες με ταύρους σε αρένες.
    Οι ταυρομάχοι (toreros) αντιμετωπίζουν τους ταύρους σε μία σειρά από τελετουργικές φάσεις, χρησιμοποιώντας κόκκινα υφάσματα
    (muleta) και ξίφη. Οι ταυρομαχίες έχουν βαθιές ρίζες στην ισπανική κουλτούρα,
    αν και σήμερα υπάρχουν έντονες αντιπαραθέσεις και διαμάχες γύρω από την ηθική και την επικινδυνότητα αυτής της πρακτικής.</p>`,

    `<p>Η <b>Semana Santa</b> (Άγια Εβδομάδα) γιορτάζεται με μεγάλες θρησκευτικές πομπές σε <b>όλη</b> την Ισπανία κατά τη διάρκεια
    της Μεγάλης Εβδομάδας πριν από το Πάσχα. Οι πομπές περιλαμβάνουν θρησκευτικές αδελφότητες (cofradías)
    που φέρουν αγάλματα του Χριστού και της Παναγίας μέσα από τους δρόμους των πόλεων και των χωριών.
    Οι πομπές είναι ιδιαίτερα εντυπωσιακές στη <b>Σεβίλλη</b>,
    όπου χιλιάδες άνθρωποι συγκεντρώνονται για να παρακολουθήσουν τις εκδηλώσεις,</p>`,

    `<p>Το <b>Fallas de Valencia</b> είναι ένα φαντασμαγορικό φεστιβάλ που πραγματοποιείται
    κάθε Μάρτιο στην πόλη της Βαλένθια, προς τιμήν του <b>Άγιου Ιωσήφ</b>, με τις βασικές ημέρες εορτασμού
    να είναι από τις <b>15</b> έως τις <b>19</b> Μαρτίου. Το φεστιβάλ περιλαμβάνει την κατασκευή και την <b>καύση</b> τεράστιων,
    πολύχρωμων <b>γλυπτών</b>, γνωστών ως <b>«fallas»</b> διαρκούν ολόκληρο το έτος, και οι γειτονιές της Βαλένθια συναγωνίζονται
    για το πιο εντυπωσιακό γλυπτό. Το αποκορύφωμα των εκδηλώσεων είναι η «Νύχτα της Καύσης» <b>(La Nit de le Cremà)</b>
    στις 19 Μαρτίου, όταν τα fallas καίγονται σε εντυπωσιακές φωτιές. Τα Fallas de Valencia συνδυάζουν τέχνη,
    πολιτισμό και παράδοση, προσελκύοντας χιλιάδες επισκέπτες από όλο τον κόσμο.</p>`,

    `<p>Και τώρα ήρθε η ώρα να σου ανοίξει η όρεξη με τα γευστικά παραδοσιακά πιάτα που προσφέρει η κουζίνα της Ισπανίας!</p> <br><br>

    <p>Η παέγια <b>(Paella)</b> είναι ένα παραδοσιακό πιάτο από την περιοχή της <b>Βαλένθια</b>, 
    που αποτελείται από ρύζι, σαφράν, θαλασσινά, κοτόπουλο, κουνέλι και διάφορα λαχανικά.
    Το πιάτο μαγειρεύεται σε ένα μεγάλο, ρηχό τηγάνι <b>(paellera)</b> και έχει πολλές παραλλαγές ανάλογα με την περιοχή.
    Η paella είναι από τα πιο αναγνωρίσιμα πιάτα παγκοσμίως.</p>`,

    `<p>Τα τάπας <b>(Tapas)</b> είναι μικρά πιάτα που σερβίρονται ως συνοδευτικά με ποτά σε μπαρ και ταβέρνες σε όλη την Ισπανία.
    Θυμίζουν αρκετά τους μεζέδες που έχουμε στα ουζερί και τις ταβέρνες στην Ελλάδα! Μπορεί
    να περιλαμβάνουν μια ποικιλία από τρόφιμα, όπως ελιές, αμύγδαλα, αλλαντικά, τυριά, θαλασσινά,
    και ζεστά πιάτα όπως πατάτες <b>bravas</b> και γαρίδες με σκόρδο.
    Η κουλτούρα του «tapeo» περιλαμβάνει το να μετακινείσαι από μπαρ σε μπαρ, απολαμβάνοντας διαφορετικά τάπας και ποτά.</p>`,

    `<p>Η τορτίγια <b>(Tortilla de patatas)</b> είναι μια παραδοσιακή ισπανική ομελέτα που παρασκευάζεται με αυγά,
    πατάτες και κρεμμύδια. Η τορτίγια μαγειρεύεται αργά σε ένα τηγάνι μέχρι να γίνει χρυσαφένια και να
    έχει μια κρεμώδη υφή στο εσωτερικό,
    Είναι ένα από τα πιο γνωστά και αγαπημένα πιάτα στην Ισπανία.</p>`,

    `<p>Το χαμόν <b>(Jamón)</b> είναι ένα παραδοσιακό ισπανικό αλλαντικό, με τις δύο κύριες ποικιλίες να είναι το <b>Jamón Serrano</b>
    και το <b>Jamón Ibérico</b>. Το Jamón Serrano προέρχεται από <b>λευκά γουρούνια</b>,
    ενώ το Ibérico από <b>μαύρα ιβηρικά γουρούνια</b>. Το χαμόν κρεμάται και ξηραίνεται
    <u>για μήνες ή και χρόνια</u>, αποκτώντας έτσι την ιδιαίτερη γεύση του.
    Είναι συχνά σερβιρισμένο λεπτοκομμένο και συνοδεύει πολλά ισπανικά πιάτα.</p>`,

    `<p>Το γκασπάτσο <b>(Gazpacho)</b> είναι μια κρύα σούπα από την <b>Ανδαλουσία</b> που παρασκευάζεται με ντομάτες,
    αγγούρια, πιπεριές, κρεμμύδια, σκόρδο και ελαιόλαδο. Είναι δροσερή και ιδανική για ζεστές καλοκαιρινές ημέρες.
    Συχνά σερβίρεται με ψιλοκομμένα λαχανικά και ψωμί.</p>`,

    `<p>Και αν σου αρέσουν τα γλυκά, τότε θα λατρέψεις τα <b>Churros</b>! Είναι ένα δημοφιλες ισπανικό γλυκό που συνήθως καταναλώνεται
    για πρωινό ή απογευματινό σνακ. Τα churros είναι <b>μακρόστενα τηγανητά ζυμάρια</b> που έχουν τραγανή εξωτερική υφή και είναι αφράτα,
    σαν τους ελληνικούς λουκουμάδες. Συχνά πασπαλίζονται με <u>ζάχαρη</u> και σερβίρονται με ένα ζεστό φλιτζάνι παχύρρευστο
    και πλούσιο σοκολατένιο ρόφημα για βούτημα. Αυτή η συνδυαστική απόλαυση είναι ιδιαίτερα αγαπητή κατα τη διάρκεια
    των κρύων μηνών και ειναι ένα χαρακτηριστικό στοιχείο των ισπανικών αγορών και καφετεριών.Τα
    churros είναι ένα «γλυκό» μέρος της κοινωνικής κουλτούρας,
    όπου φίλοι και οικογένειες συναντιούνται για να απολαύσουν αυτές τις νόστιμες λιχουδιές μαζί.</p>`,

    `<p>Για την δίψα, έχουμε να προτείνουμε την <b>Sangría</b> και την <b>Horchata</b>! Η Sangría είναι ενα παραδοσιακό ποτό που
    παρασκευάζεται με <b>κόκκινο κρασί, φρούτα</b> όπως πορτοκάλια, λεμόνια και μήλα, και συχνά προστίθεται <b>κονιάκ ή λικέρ</b>,
    καθώς και γλυκαντικά και ανθρακούχο νερό ή λεμονάδα.
    Η σανκρία είναι δροσερή και αναζωογονητική και σερβίρεται συχνά το καλοκαίρι.</p>`,

    `<p>Η <b>Horchata</b> (ορτσάτα) είναι παραδοσιακό ρόφημα, ιδιαίτερα δημοφιλές στην περιοχή της Βαλένθια.
    Παρασκευάζεται από <b>νερό, ζάχαρη και chufas</b> (κίτρινη κύπερη στα ελληνικά),
    μικρούς βολβούς που προέρχονται από την περιοχή. Το ρόφημα είναι δροσερό, γλυκό και έχει
    μια <u>ελαφρώς καρυδένια γεύση</u>. Η Horchata είναι γνωστή για τις αναζωογονητικές
    της ιδιότητες και συχνά σερβίρεται παγωμένη κατά τους καλοκαιρινούς μήνες.
    Συνήθως συνοδεύεται από ένα είδος γλυκού ψωμιού, γνωστό ως <b>fartons</b>, 
    το οποίο βουτιέται στο ρόφημα. Αποτελεί αναπόσπαστο μέρος της ισπανικής γαστρονομικής παράδοσης
    και είναι ιδιαίτερα αγαπητή από ντόπιους και τουρίστες
    για τη μοναδική της γεύση και την ιστορική της σημασία στην τοπική κουλτούρα.</p>`,
    
];


let currentChapter = 0;

function showQuizButton() {
    const chapterContent = document.getElementById('buttons');
    const quizButton = document.createElement('button');
    quizButton.className = 'buttonSeeMore';
    quizButton.textContent = 'Πάμε για εξάσκηση!';
    quizButton.onclick = function() {
        window.location.href = '/quizzes/2';
    };
    chapterContent.appendChild(quizButton);
    quizButton.scrollIntoView({ behavior: 'smooth' });
}

function showNextChapter() {
    if (currentChapter < chapter2_theory.length) {
        const contentDiv = document.getElementById('content');
        const newDiv = document.createElement('div');
        newDiv.classList.add('chapter');
        newDiv.innerHTML = chapter2_theory[currentChapter];
        contentDiv.appendChild(newDiv);
        newDiv.scrollIntoView({ behavior: 'smooth' });
        currentChapter++;
        if (currentChapter == chapter2_theory.length)
        {
            document.getElementById('nextChapterButton').remove()
            showQuizButton();
        }
    } else {
        alert("No more chapters to display.");
    }
}



document.getElementById('nextChapterButton').addEventListener('click', showNextChapter);
document.addEventListener('DOMContentLoaded', showNextChapter);