const chapter1_theory = [
    `Η Ισπανία (ισπανικά: <b>España</b>), επίσημα το Βασίλειο της Ισπανίας (ισπανικά: <b>Reino de España</b>),
    είναι κράτος της νότιας Ευρώπης που καταλαμβάνει το μεγαλύτερο μέρος της Ιβηρικής χερσονήσου. 
    Συνορεύει με την Γαλλία, την Ανδόρρα, το Γιβραλτάρ και την Πορτογαλία, 
    ανατολικά και νότια βρέχεται από τη Μεσόγειο Θάλασσα και νοτιοδυτικά βρέχεται από τον Ατλαντικό ωκεανό. `,

    `Έχει έκταση 504.645 τ.χλμ. και συνολικό πληθυσμό 48.592.909 κατοίκους,
    σύμφωνα με επίσημη εκτίμηση για τον Ιανουάριο του 2024.
    Πρωτεύουσα και μεγαλύτερη πόλη της Ισπανίας, είναι η <b>Μαδρίτη</b>.`,

    `Η Ισπανία μοιράζεται μεγάλο μέρος της ιστορίας της με την Πορτογαλία, την Ανδόρρα και τη νότια Γαλλία. 
    Κατά την αρχαιότητα στην περιοχή έζησαν διάφοροι λαοί, όπως οι Ίβηρες και οι Κέλτες, 
    οι οποίοι αφομοιώθηκαν από τους Ρωμαίους μετά τη ρωμαϊκή κατάκτηση. 
    Ωστόσο, η μουσουλμανική κατάκτηση της Ιβηρικής άλλαξε ριζικά τον χαρακτήρα των Ισπανογότθων, 
    εντάσσοντας την Ιβηρική χερσόνησο στον μουσουλμανικό κόσμο.`,

    `Μία από τις πιο γνωστές προσωπικότητες είναι ο <b>Χριστόφορος Κολόμβος</b> (1451-1506).
    Ήταν Ιταλός εξερευνητής και θαλασσοπόρος, ο οποίος είναι πιο γνωστός για τα ταξίδια του που οδήγησαν στην ανακάλυψη
    της Αμερικής από τους Ευρωπαίους. Γεννήθηκε στη <b>Γένοβα</b> (σημερινή Ιταλία) και αρχικά ασχολήθηκε με τη ναυτιλία και
    το εμπόριο. <br><br>
    Το <b>1492</b>, με την υποστήριξη των Καθολικών Βασιλέων της Ισπανίας, <b>Φερδινάνδου</b> και <b>Ισαβέλλας</b>,
    ο Κολόμβος ξεκίνησε το πρώτο του ταξίδι με τρία πλοία: τη <b>ΣANTA ΜΑΡΙΑ</b>, τη <b>ΠΙΝΤΑ</b> και τη <b>ΝΙΝΑ</b>.
    Στόχος του ήταν να βρει μια θαλάσσια διαδρομή προς την Ασία, αλλά αντ' αυτού έφτασε στα νησιά της Καραϊβικής,
    που σήμερα αποτελούν μέρη της Κούβας και των Μπαχάμας. Παρακάτω φαίνεται ο χάρτης με τα ταξίδια που έκανε.`,

    `Παρά τη σημασία των ανακαλύψεών του, ο Κολόμβος πέθανε το <b>1506</b> πιστεύοντας ότι είχε βρει μια νέα διαδρομή προς την Ασία,
    και δεν συνειδητοποίησε ότι είχε ανακαλύψει μια ολόκληρη νέα ήπειρο. Η συμβολή του στις εξερευνήσεις του
    Νέου Κόσμου είχε βαθιές επιπτώσεις στην ιστορία, επιφέροντας την Ευρωπαϊκή αποικιοκρατία και τον εποικισμό των
    Αμερικανικών ηπείρων.Παρά τη σημασία των ανακαλύψεών του, ο Κολόμβος πέθανε το 1506 πιστεύοντας ότι είχε βρει
    μια νέα διαδρομή προς την Ασία, και δεν συνειδητοποίησε ότι είχε ανακαλύψει μια ολόκληρη νέα ήπειρο.
    Η συμβολή του στις εξερευνήσεις του Νέου Κόσμου είχε βαθιές επιπτώσεις στην ιστορία,
    επιφέροντας την Ευρωπαϊκή αποικιοκρατία και τον εποικισμό των Αμερικανικών ηπείρων.`,

    `Η Ισπανία γενικά αποτελεί ένα τεράστιο σε έκταση οροπέδιο που διαμοιράζεται από αλλεπάλληλες οροσειρές
    σε επιμέρους μικρότερα οροπέδια. Η μεγαλύτερη οροσειρά της Ισπανίας είναι η Σιέρα Νεβάδα <b>(Sierra Nevada)</b>,
    που βρίσκεται στην περιοχή της <b>Ανδαλουσίας</b>, στη νότια Ισπανία. Η υψηλότερη κορυφή της,
    και ταυτόχρονα η υψηλότερη κορυφή της Ιβηρικής Χερσονήσου, είναι η Μουλάσεν <b>(Mulhacén)</b>,
    η οποία φτάνει σε ύψος τα <b>3.479</b> μέτρα.`,

    `Οι Ισπανοί είναι κατά το μεγαλύτερο μέρος τους χριστιανοί Ρωμαιοκαθολικοί,
    αν και η δύναμη της Εκκλησίας έχει μειωθεί αρκετά τα τελευταία χρόνια.
    Σήμερα το Ισπανικό Σύνταγμα (άρθρο 16) παρέχει και προστατεύει πλήρως την ανεξιθρησκία, που είχε ξεκινήσει από το 1868.
    Έτσι από τις 29 Δεκεμβρίου 1978 δεν υφίσταται ο όρος «επίσημη θρησκεία» στην Ισπανία.`,

    `Η Ισπανία διαθέτει πληθώρα μνημείων και ιστορικών τοποθεσιών που αντανακλούν την πλούσια ιστορία και τον πολιτισμό της.
    Ας δούμε κάποια βασικά μνημεία μαζί.`,

    `1. Η Αλάμπρα <b>(La Alhambra)</b> <br><br>

    Η Αλάμπρα είναι ένα επιβλητικό <u>συγκρότημα παλατιών</u> και φρουρίων στη <b>Γρανάδα</b>.
    Χτίστηκε κατά την εποχή των Μαυριτανών και αποτελεί ένα από τα καλύτερα παραδείγματα της ισλαμικής αρχιτεκτονικής στην Ισπανία.
    Το συγκρότημα περιλαμβάνει το <b>Παλάτι των Νασρίντ</b>, τον <b>Παράδεισο του Λίντερ</b>, και τον <b>Γενεραλίφε</b>, έναν όμορφο κήπο.`,

    `2. Η Σαγράδα Φαμίλια <b>(La Sagrada Família)</b> <br><br>

    Η Σαγράδα Φαμίλια είναι μια μεγάλη, ημιτελής ρωμαιοκαθολική βασιλική στη <b>Βαρκελώνη</b>, σχεδιασμένη από τον
    διάσημο αρχιτέκτονα <b>Αντόνι Γκαουντί</b>.
    Η κατασκευή της ξεκίνησε το <b>1882</b> και αναμένεται να ολοκληρωθεί γύρω στο <b>2026</b>.
    Είναι γνωστή για τον μοναδικό της σχεδιασμό και τις εντυπωσιακές της λεπτομέρειες.`,

    `3. Ο Καθεδρικός της Σεβίλλης <b>(Catedral de Sevilla)</b> <br><br>

    Ο Καθεδρικός της Σεβίλλης είναι ο μεγαλύτερος <u>γοτθικός καθεδρικός ναός στον κόσμο</u> και o
    τρίτο μεγαλύτερος χριστιανικός ναός.
    Χτίστηκε στον 15ο αιώνα και στεγάζει τον τάφο του <b>Χριστόφορου Κολόμβου</b>.
    Το καμπαναριό του, γνωστό ως Γιράλντα <b>(La Giralda)</b>, ήταν αρχικά μιναρές ενός τζαμιού.`,

    `4. Το Μοναστήρι του Ελ Εσκοριάλ <b>(El Escorial)</b> <br><br>

    Το Μοναστήρι του Ελ Εσκοριάλ βρίσκεται κοντά στη Μαδρίτη και είναι ένα τεράστιο συγκρότημα που περιλαμβάνει μοναστήρι, 
    βασιλικό παλάτι, μουσείο, και βιβλιοθήκη.
    Χτίστηκε από τον <b>Φίλιππο Β'</b> της Ισπανίας τον 16ο αιώνα και 
    αποτελεί ένα από τα πιο σημαντικά <b>αναγεννησιακά κτίρια</b> της χώρας.`,

    `5. Το Πάρκο Γκουέλ <b>(Parc Güell)</b> <br><br>

    Το Πάρκο Γκουέλ είναι ένας δημόσιος χώρος στην Βαρκελώνη, σχεδιασμένος από τον <b>Αντόνι Γκαουντί</b>.
    Το πάρκο συνδυάζει φυσικά στοιχεία και μοντέρνα αρχιτεκτονική και είναι γνωστό
    για τα πολύχρωμα μωσαϊκά και τις οργανικές μορφές του.
    Είναι μέρος της <b>Παγκόσμιας Πολιτιστικής Κληρονομιάς</b> της UNESCO.`,

    `6. Το Μεσκίτα <b>(Mezquita)</b> της Κόρδοβας <br><br>

    Το Μεσκίτα είναι ένα τεράστιο τζαμί-καθεδρικός ναός στην <b>Κόρδοβα</b>, αρχικά χτισμένο ως τζαμί τον <b>8ο αιώνα</b> και αργότερα
    μετατράπηκε σε χριστιανικό καθεδρικό ναό μετά την επανάκτηση της πόλης από τους Χριστιανούς.
    Είναι γνωστό για τις κολόνες και τα τόξα του, καθώς και για τον μιχράμπ (ιερό).`,

    `7. Το Πάρδο <b>(Museo del Prado)</b>
    Το Πάρδο είναι το εθνικό μουσείο τέχνης της Ισπανίας και βρίσκεται στη <b>Μαδρίτη</b>.
    Στεγάζει μία από τις πιο εκτεταμένες και σημαντικές συλλογές ευρωπαϊκής τέχνης,
    συμπεριλαμβανομένων έργων από τους <b>Βελάσκεθ, Γκόγια, Ελ Γκρέκο,</b> και πολλών άλλων.`,

];

let currentChapter = 0;

function showQuizButton() {
    const chapterContent = document.getElementById('buttons');
    const quizButton = document.createElement('button');
    quizButton.className = 'buttonSeeMore';
    quizButton.textContent = 'Take Quiz for this Chapter';
    quizButton.onclick = function() {
        window.location.href = '/quizzes/1';
    };
    chapterContent.appendChild(quizButton);
    quizButton.scrollIntoView({ behavior: 'smooth' });
}

function showNextChapter() {
    if (currentChapter < chapter1_theory.length) {
        const contentDiv = document.getElementById('content');
        const newDiv = document.createElement('div');
        newDiv.classList.add('chapter');
        newDiv.innerHTML = chapter1_theory[currentChapter];
        contentDiv.appendChild(newDiv);
        newDiv.scrollIntoView({ behavior: 'smooth' });
        currentChapter++;
        if (currentChapter == chapter1_theory.length)
        {
            showQuizButton();
        }
    } else {
        alert("No more chapters to display.");
    }
}



document.getElementById('nextChapterButton').addEventListener('click', showNextChapter);
document.addEventListener('DOMContentLoaded', showNextChapter);


