const facts = [
    "Η Ισπανία είναι η δεύτερη πιο ομιλούμενη μητρική γλώσσα στον κόσμο, μετά τα μανδαρινικά κινέζικα.",
    "Η Μαδρίτη φιλοξενεί το παλαιότερο εστιατόριο του κόσμου, το Sobrino de Botín, το οποίο λειτουργεί από το 1725.",
    "Η Ισπανία φιλοξενεί το ετήσιο φεστιβάλ La Tomatina στο Μπουγιόλ, όπου οι συμμετέχοντες πετούν ντομάτες ο ένας στον άλλο για διασκέδαση.",
    "Ο παθιασμένος χορός και η μουσική που είναι γνωστά ως φλαμένκο προήλθαν από την περιοχή της Ανδαλουσίας.",
    "Η Ισπανία διαθέτει περισσότερους από 45 μνημείους παγκόσμιας κληρονομιάς της UNESCO, συμπεριλαμβανομένων της Αλάμπρα, της Σαγράδα Φαμίλια και της ιστορικής πόλης του Τολέδο.",
    "Ενώ πολλοί πιστεύουν ότι το εθνικό άθλημα της Ισπανίας είναι το ποδόσφαιρο, στην πραγματικότητα είναι η ταυρομαχία, αν και είναι ένα αμφιλεγόμενο θέμα.",
    "Η Ισπανία έχει ένα από τα υψηλότερα προσδόκιμα ζωής στον κόσμο, δεύτερη μόνο μετά την Ιαπωνία.",
    "Η Ισπανία είναι γνωστή για την νόστιμη και ποικίλη κουζίνα της, συμπεριλαμβανομένων των τάπας, της παέγια και του παγκοσμίου φήμης ιβηρικού ζαμπόν.",
    "Η Ισπανία είναι διάσημη για τα πολυάριθμα ζωντανά και μοναδικά φεστιβάλ της, όπως το Σαν Φερμίν (Τρέξιμο των Ταύρων) στην Παμπλόνα και το Λας Φάλλας στη Βαλένθια.",
    "Ο διάσημος καλλιτέχνης Πάμπλο Πικάσο γεννήθηκε στη Μάλαγα της Ισπανίας. Τα έργα του είχαν βαθιά επίδραση στη σύγχρονη τέχνη.",
    "Τα Κανάρια Νησιά, που βρίσκονται στα βορειοδυτικά παράλια της Αφρικής, είναι μέρος της Ισπανίας και είναι γνωστά για τις εκπληκτικές παραλίες και τα ηφαιστειακά τοπία τους.",
    "Η σύγχρονη σφουγγαρίστρα και κουβάς εφευρέθηκαν στην Ισπανία από τον Μανουέλ Χαλόν Κορομίνας τη δεκαετία του 1950.",
    "Η Ισπανία φιλοξενεί τη μοναδική έρημο της Ευρώπης, την έρημο Ταβέρνας, η οποία βρίσκεται στην επαρχία της Αλμερίας.",
    "Πολλές αγγλικές λέξεις, ειδικά στους τομείς της μουσικής, της λογοτεχνίας και της γαστρονομίας, έχουν ισπανικές ρίζες, όπως 'patio,' 'tango,' και 'barbecue.'",
    "Εκτός από τα ισπανικά, η Ισπανία έχει αρκετές περιφερειακές γλώσσες, συμπεριλαμβανομένων των καταλανικών, γαλικιανών και βασκικών, που αντικατοπτρίζουν την ποικιλόμορφη πολιτιστική της κληρονομιά.",
    "Η Ισπανία έχει τη μεγαλύτερη παραγωγή ελαιολάδου στον κόσμο, με την Ανδαλουσία να είναι η κύρια περιοχή παραγωγής.",
    "Το πανέμορφο νησί της Μαγιόρκα ανήκει στις Βαλεαρίδες Νήσους και είναι γνωστό για τις παραλίες και την ιστορία του.",
    "Η Ισπανία είναι η χώρα με τις περισσότερες βραβευμένες με αστέρι Michelin εστιατόρια στη Νότια Ευρώπη.",
    "Η γλώσσα των Καταλανών, η Καταλανική, ομιλείται επίσης στη Βαρκελώνη και σε άλλες περιοχές της Ισπανίας.",
    "Το Σαν Σεμπαστιάν, γνωστό ως Donostia στη Βασκική γλώσσα, έχει μια από τις πιο φημισμένες γαστρονομικές σκηνές της Ευρώπης.",
    "Η Ισπανία είναι ο μεγαλύτερος παραγωγός κρασιού στον κόσμο, με περιοχές όπως η Ριόχα και η Ριμπέρα ντελ Ντούερο να είναι παγκοσμίως γνωστές.",
    "Η Σαραγόσα φιλοξενεί τον Παλάτιο ντε Λα Λονχά, ένα αναγεννησιακό κτήριο που χρησιμοποιείται για δημόσιες εκδηλώσεις και γάμους.",
    "Το νησί της Τενερίφης, στις Κανάριες Νήσους, έχει τον ψηλότερο ηφαιστειακό βουνό στην Ισπανία, το Τέιντε.",
    "Η Ισπανία είναι γνωστή για τα παραδοσιακά της φεστιβάλ, όπως το φεστιβάλ των φωτιών στη Βαλένθια, το οποίο περιλαμβάνει τεράστιες φωτιές και εντυπωσιακές παρελάσεις.",
    "Η Ισπανία έχει πάνω από 8.000 χιλιόμετρα ακτογραμμής, προσφέροντας αμέτρητες ευκαιρίες για θαλάσσιες δραστηριότητες.",
    "Η Ισπανία ήταν το πρώτο κράτος που αναγνώρισε την ανεξαρτησία της Λατινικής Αμερικής από την Ισπανία τον 19ο αιώνα.",
    "Η Ισπανία διαθέτει ορισμένα από τα πιο παλιά ευρωπαϊκά πανεπιστήμια, όπως το Πανεπιστήμιο της Σαλαμάνκα, που ιδρύθηκε το 1134.",
    "Ο Σαλβαδόρ Νταλί, ένας από τους πιο γνωστούς σουρεαλιστές καλλιτέχνες, καταγόταν από την Καταλονία.",
    "Η Ισπανία έχει μια πλούσια παράδοση στον αθλητισμό, με ομάδες όπως η Ρεάλ Μαδρίτης και η Μπαρτσελόνα να έχουν κερδίσει πολλούς τίτλους στο ποδόσφαιρο."

];


function getRandomFact() {
    const randomIndex = Math.floor(Math.random() * facts.length);
    return facts[randomIndex];
}

document.getElementById('did-you-know-fact').innerText = getRandomFact();